<?php
  $x = 3;
  if ($x >= 10 && foo())//&&前面的條件要成立才會執行後面的運算式
    echo "yes";
  else
    echo "no";
    
  echo "<hr>";

  $x = 3;
  if ($x >= 10 & foo()) //不管&前面的條件有沒有成立都會執行後面的運算式
    echo "yes";
  else
    echo "no";
    
  /*----------------------------------------------------------------------
  $x = 3;
  if ($x >= 10 || foo())//||任一條件成立就會執行後面的運算式
    echo "yes";
  else
    echo "no";
    
  echo "<hr>";

  $x = 3;
  if ($x >= 10 | foo()) //不管|前面的條件有沒有成立都會執行後面的運算式
    echo "yes";
  else
    echo "no";
  ----------------------------------------------------------------------*/
    
function foo()
{
   echo "foo() is running.<br>";
}

?>